In [1]:
import pandas as pd
from fuzzywuzzy import fuzz
from fuzzywuzzy import process

In [2]:
port_name_path = './data/port_name.csv'

In [4]:
destination_path = './data/destination_with_sector.csv'

In [504]:
port_code_path = './data/111.csv'

In [6]:
df_port_name = pd.read_csv(port_name_path)

In [505]:
df_port_code = pd.read_csv(port_code_path)

In [8]:
df_destination = pd.read_csv(destination_path)

In [9]:
df_port_name.head()

    port_name
0    Aabenraa
1    Aaheim m
2     Aalborg
3      Aalvik
4  Aandalsnes

In [10]:
df_port_code.head()

  port_code                          port_name country_code
0     CNSZX                           Shenzhen           CN
1     VNSGN  Ho Chi Min City (formerly Saigon)           VN
2     DKAAB                           Aabenraa           DK
3     SGSIN                          Singapore           SG
4     INNSA                        NHAVA SHEVA           IN

In [11]:
df_destination.head()

     destination      imo                update_time    sector
0         IT CAG  9143403  22/4/2020 07:12:52.423+00  DRY BULK
1         MANILA  9118941  22/4/2020 07:12:52.423+00  DRY BULK
2  RAVENNA,ITALY  9309629  22/4/2020 07:12:52.423+00    TANKER
3            SHV  9828209  22/4/2020 07:12:52.423+00    TANKER
4       ST JOHNS  9551935  22/4/2020 07:12:52.423+00  DRY BULK

In [12]:
df_target = df_destination[['imo', 'sector', 'destination']]

In [13]:
df_target.head()

       imo    sector    destination
0  9143403  DRY BULK         IT CAG
1  9118941  DRY BULK         MANILA
2  9309629    TANKER  RAVENNA,ITALY
3  9828209    TANKER            SHV
4  9551935  DRY BULK       ST JOHNS

In [14]:
len(df_target)

42045

In [15]:
df_target['imo'].value_counts()

8405220    4
9007764    4
9777369    4
9215543    4
8520202    4
          ..
9447184    1
9426702    1
9359117    1
9305867    1
9242625    1
Name: imo, Length: 38863, dtype: int64

In [18]:
port_name_ls = df_port_name['port_name'].tolist()

In [20]:
code_list = df_port_code['port_code'].tolist()
name_list = df_port_code['port_name'].tolist()
code_dic = {}
for code, name in zip(code_list, name_list):
    code_dic[code] = name

----

In [62]:
df_sample = df_target.sample(5000)

In [63]:
df_sample = df_sample.reset_index(drop=True)

In [64]:
len(df_sample)

5000

In [65]:
df_sample.head()

       imo    sector    destination
0  9216547    TANKER  CIENFUEGOS.CU
1  9618680       DRY    TJ.BARA,IDN
2  9550462       DRY          SHIHU
3  8902826  DRY BULK      SINGAPORE
4  9692428    TANKER         CN CJK

In [66]:
destination_list = df_sample['destination'].tolist()

In [135]:
data = []
for des in destination_list:
    ratio_list = []
    
    if '>' in str(des):
        index = des.index('>') + 1
        if 'OFF' in str(des):
            index_off = des.index('OFF')
            des = des[index: index_off].strip()
        else:
            des = des[index: ].strip()
        for name in port_name_ls:
            ratio = fuzz.token_set_ratio(des, name)
            ratio_list.append((name + ' + code1+3', ratio))
        for code in code_dic.keys():
            ratio = fuzz.token_set_ratio(des, code)
            ratio_list.append((code_dic[code] + ' + code2+3', ratio))
    else:    
        for name in port_name_ls:
            ratio = fuzz.token_set_ratio(des, name)
            ratio_list.append((name + ' + code1', ratio))
        for code in code_dic.keys():
            ratio = fuzz.token_set_ratio(des, code)
            ratio_list.append((code_dic[code] + ' + code2', ratio))

    ratio_rank = sorted(ratio_list, key=lambda x: x[1],reverse=True)[:5]

    scores_list = []
    for (name, ratio) in ratio_rank:
        scores_list.append(name)
        scores_list.append(ratio)

    data.append(scores_list)

In [137]:
len(data)

5000

In [138]:
col_name = ['top1', 'score1','top2', 'score2', 'top3', 'score3', 'top4', 'score4', 'top5', 'score5']

In [139]:
df_data = pd.DataFrame(data, columns=col_name)

In [140]:
df_data.head()

,top1,score1,top2,score2,top3,score3,top4,score4,top5,score5
0,Cienfuegos + code1,100,Santiago de Cuba + code2,56,Foshan + code2,56,Kuchinotsu + code1,52,Cienaga + code1,50
1,Itajai + code2,62,Tanjung Bara + code1,61,Rapid Bay + code1,60,Bartin + code1,59,Barbers Point + code1,58
2,Shihu + code1,100,Shingu + code1,73,Shishi + code1,73,Huizhou + code1,67,Sibu + code1,67
3,Singapore + code1,100,Gopalpur + code2,71,Helsingor + code1,67,Port Dina + code1,67,Surigao + code1,62
4,Kuchinotsu + code2,55,Chanaral + code2,55,Jiangmen + code2,55,"Kingstown, St. Vincent + code2",55,Kawagoe + code2,55

In [141]:
df_result = pd.concat([df_sample, df_data], axis=1)

In [343]:
len(df_result)

NameError: name 'df_result' is not defined

In [143]:
df_result.head()

,imo,sector,destination,top1,score1,top2,score2,top3,score3,top4,score4,top5,score5
0,9216547,TANKER,CIENFUEGOS.CU,Cienfuegos + code1,100,Santiago de Cuba + code2,56,Foshan + code2,56,Kuchinotsu + code1,52,Cienaga + code1,50
1,9618680,DRY,"TJ.BARA,IDN",Itajai + code2,62,Tanjung Bara + code1,61,Rapid Bay + code1,60,Bartin + code1,59,Barbers Point + code1,58
2,9550462,DRY,SHIHU,Shihu + code1,100,Shingu + code1,73,Shishi + code1,73,Huizhou + code1,67,Sibu + code1,67
3,8902826,DRY BULK,SINGAPORE,Singapore + code1,100,Gopalpur + code2,71,Helsingor + code1,67,Port Dina + code1,67,Surigao + code1,62
4,9692428,TANKER,CN CJK,Kuchinotsu + code2,55,Chanaral + code2,55,Jiangmen + code2,55,"Kingstown, St. Vincent + code2",55,Kawagoe + code2,55

In [144]:
df_result.to_csv('./data/result_sample.csv', encoding='utf_8', header=1, index=0)

In [ ]:
dr_result.to_ex

In [136]:
df_result=df_result.drop(index=df_result.index)

In [128]:
for des in destination_list:
    if '>' in str(des):
        index = des.index('>')
        if 'OFF' in str(des):
#             print(des + ' ori')
            index_off = des.index('OFF')
            des = des[index + 1: index_off].strip()
        else:
#             print(des + ' ori')
            des = des[index + 1 :].strip()
        print(des)

TH LCH
TRTUZ
MAPTM
FRLEH
>KRYOS
TRTEK
NG APP
JP UKB E4 0FF
USPON
JP YOS
HR RJK
ESCEU
JP THS
JP SKD
JP MUR
JP NGI JXTG H5-9
HK HKG
JP NIC
JP SYZ
JP TMK 2W
GNCKY
JP NSR 0FF
IT TRS
CD MAT
JP HKP
JP UKB
JP ISG
>JEDDAH
PHE AU
MASFI
JP KWS
CHINA
>AU WEI
SG SIN
BANCO DEL HOYO
JP MIZ FM
JP MTS
JP KSM CN
FIRAU
JP SHN
LKCMB ANCH.
CN ZOS
CN
CNZOS
IDKSO
VN HPH
FI SKV
CNSHA
JP CHB
KR PUS
JP TTY
JP SBK
VN HPH
OMMFH
EOPL
MAVIL
PEBGC
JP   FNB  IE
JP ONX
OPL ESCAD
SN DKR
JP SBK
TRGOL
USBOS
JP FTX
US EWR
>GIGIB
BR SSZ
PL GDN
BD CHITTAGONG
TTPTS
SG SIN
VN CPH
JP TXD (TOKUYAMA)
US PEF
CNNGB
ID SUB
>SEUDD
HK HKG
US ILG
JP SUZ
KII
>EGPSD
>>GBPEM
JP KWS HBM>W9R<&*O
JP HKS
CA WNE
NL VLI
GLADSTONE, AUS
JP KND
JP TBN
JP TYO
>CAMTR
KR YOS
JPCHB
> DE EME
JP CHB
SD PZU
JP KNM
NLRTM
<GBIMM
JP TRG
JP YKK
ISPTO
TR TUZ
AEDXB
> CN TXG
BDCGP
>TRALI
JP OIP
BEZEE
ID CIG
BE ANR
JP HKP
SGSIN(PEBGA)
> TWTPE
ILHFA
VNSGNCL
KR TSN
PH CEB
JP CHB
ES SAG
PAN BLB
JP HHR
YE ADE
TW KHH
NG ESC
JP KNM HESAKI
ID KUM
TRTIR
CNQIN
NLRTM APM1
RUVVO
JP HIM
SAJED
NL
JP OIG
KR PTK/SS
AUSYD
IEAUG
RUVVO
GB SOU ANCH
NG APP
MTMLA
JP UKB R
JP FKY RORO-W
GAOWE
CNDLC
JP NAT
JP TYO O
CGPNR
JP NGO
CN ZOS
KR PUS
MXVER
SG SIN
SADMM
>> PK BQM
ESVLC
FRLAV
FRLAV
LKCMB
MY PGG
JP SGM TIE
PHI
ZA PLZ
>CNYAT
ARSLO
JP TXD
>INMUN
?? ???
SG PEBGA
TR BDM
OW LOS H  "
JP AOM
GBFNT
JP SGM
INVTZ
NLRTM
JP NAO
USMSY
JPTMKE1
JP IWK
JP KND
JP YOK/NGI/NNX
JPTYO
JP MIZ
US PWM
FRURO
USHOU
BS FPO
>SG SIN
GUAPR
CU CFG
BRSSZ
JP KRE
JP ONA
PKQCT
EG PSD
NZTRG
SE GOT
JP SBK
POHANG
JP TMK S
INSIK
CN SHD
?? ???
KRUSN
JP FKY
CNNTG
JP KWS
JP UBJ SEIBU-5-11
US GLS
USCHS
ARPMY
JP KSM
DAGENHAM
SUNGAIPAKNING
EG SUZ
MYPTP
JP TYO O"
ITSPE
US PEV
JP KNY
GHTKD
JP KSM
SHANHAIGUAN
IRAN
GB SOU
PA BLB
AEFJR
ITTRS
JP FTX FUSHIKI
>HUANGHUA
SINGAPORE
JP TYO R
CN YTN
JP OSA
JP  YOK AZ
JP HHR W5
JP WAK
CN NGB
JP IHA
KR PUS
CWS
GBTTL
JP UKB
P NAGO
CN ZOS
JP TYO
USHPY
JP KNX
DEHAM
JP IHA
USLGB
MAPTM
CHSHA
AU GLT
TR ISK
JP KSM/CS/4B
KW MEA
USLGB
USLAX
KRPUS
MG TLE
AUGEX
>AR SLO
KR YOS
ID SUB
PTK KR
MACAS
JP MIZ
ILHFA
JP RHK
BRMCZ
PA CTB
RU MMK
USNYC
RUBAI
SG
>INMUN
JP AMX
CO BAQ
JP TMK
PEILQ
VE ELP
BE ANR
PH SFS
AU BNE
JP KOJ
JP YOK D
JP SBK
JP YOK
JP CHB
MXLZC
SGSIN PEBGA
TW KHH
>PACTB
ZJG,CN
IDSUB
EGSUZ
MY PKG
JP OSA E/A
JP OIP TSURUSAKI
IN MUN
EG SUZ
>EGDAM
KAN/ AS
ZA PLZ
JP ANE
US NNS
>OMSLL
JP NNX
CN TAO
USSEA
US NYC
JP NGO 3B

JP MIZ TS
JP SGM NAKANO4
JP KWS IU
NO ORK
NZNSN
>GHTEM
JP ANE
CNYSA
JP YKK 3E
>>NLROT
GBSOU
JP KWS DU
TZDAR
>MXATM
USPGL
KR KAN/K12
BR PNG
GB HUL
TMK EAST
JP NAS
ILHFA
BRAZIL
JP ISG K
JP KWS
RU SAB
>TAIPEI
LK CMB
GH TEM
AGSJO
JP SBK 2
NOTOS
CA VAN
JPKOBE
>SGSIN PEBGB
MYPKG
>MUPLU
MYTPP
DEBRV
CA VAN
> JP MYJ
BR SPB
CNTAX
JP KSM
JP IHA
JP KWS TU
JP HHR
AEJEA
MY PKG
JP SGM
>YALOVA  ANCH.
>>>BJCOO
OMSLL

In [ ]:
JP UKB E4 0FF

In [ ]:
CACOC

In [134]:
ratio_list = []
for name in port_name_ls:
        ratio = fuzz.token_set_ratio('BD CHITTAGONG', name)
        ratio_list.append((name + ' + code1', ratio))
for code in code_dic.keys():
    ratio = fuzz.token_set_ratio('BD CHITTAGONG', code)
    ratio_list.append((code + ' + code2', ratio))

ratio_rank = sorted(ratio_list, key=lambda x: x[1],reverse=True)[:5]
    
scores_list = []
for (name, ratio) in ratio_rank:
    scores_list.append(name)
    scores_list.append(ratio)
    
print(scores_list)

['Chittagong + code1', 100, 'Changhong + code1', 64, 'Chita - LNG + code1', 64, 'Chicago + code1', 60, 'Chenjiagang + code1', 58]

In [93]:
for code in code_dic.keys():
    if code == 'CACOC':
        print(code)

CACOC

In [95]:
process.extract("CACOC", code_dic.keys(), limit=5)

[('CACOC', 100), ('CABCO', 80), ('CAIOC', 80), ('CACBC', 80), ('COTCO', 60)]

In [1]:
import re

In [33]:
pattern = re.compile('/[A-Z]/')

In [67]:
string = '>JP NAH U7'

In [68]:
res = re.findall(r'\S*\D', string)

In [69]:
print(res)

['>JP ', 'NAH ', 'U']

In [70]:
re.findall('[A-Z]', 'JP NAH U7')

['J', 'P', 'N', 'A', 'H', 'U']

In [74]:
d = 'JP NAH U7'

In [79]:
res = ''.join(re.findall(r'[A-Z]',d))

print(res)

JPNAHU

In [80]:
res = ''.join(re.findall(r'[A-Z]',d))[:5]

print(res)

JPNAH

In [85]:
t_1 = pd.read_csv('./data/t1.csv')

In [91]:
t_1.head()

,id,imo,sector,destination,top1,score1,top2,score2,top3,score3,top4,score4,top5,score5
0,94157,9306469,TANKER,MZMNC,Nacala + MZMNC,100,Mahajunga + MGMJN,60,Nouakchott + MRNKC,60,Cozumel + MXCZM,60,Rangoon + MMRGN,60
1,94162,9461489,CONTAINER,CNVAN-->CNTAO,Qingdao (formerly Tsingtao) + CNTAO&&>,100,TAICANG + \tCNTA&&>,89,Cinta + name&&>,80,Taixing + CNTAX&&>,80,Taizhou + CNTZO&&>,80
2,94195,9493743,DRY BULK,UAYUZ,Yuzhny + UAYUZ,100,Mayaguez + name,62,Suez Bay + name,62,Tubay + name,60,Xiuyu + name,60
3,94242,9314222,CONTAINER,CAPRR,Prince Rupert + CAPRR,100,Three Rivers + CATRR,80,Prescott (Usa) + CAPRE,80,Aparri + name,73,Canaport + name,62
4,94247,9503940,TANKER,SRPBM,Paramaribo + SRPBM,100,Paranam + SRPRM,80,Smalkalden + \tSRSM,67,Bandar Imam Khomeini + IRBKM,60,Bahia Las Minas + PAPBM,60

In [87]:
test_list = t_1['destination'].tolist()

In [90]:
print(test_list[:50])

['MZMNC', 'CNVAN-->CNTAO', 'UAYUZ', 'CAPRR', 'SRPBM', 'COCVE', 'USSFO>PABLB', 'GRPIR>ITCVV', 'CNYSA>CNNGB', 'IQKAZ', 'FRBAY', 'ITSPE', 'MYTPP', 'MTMLA OPL', 'EGDAM', 'RUTAM>GRPIR', 'GBWPT GBAVO GBWPT', 'MXZLO', 'ESBIO', 'USPAB', 'USMIA', 'JPKZU>PABLB', 'MYPGU - CNZJG', 'COCTG', 'RUNVS>NLRTM', 'KRTAN', 'IDAMA', 'DOHAI', 'USPEF', 'AESHJ', 'CNNGB', 'GBCTM', 'PORT NECHES>USPON', 'EGWAF>EGRAG', 'RUSHA', 'ITAUG', 'TZDAR', 'JPKUH', 'GBIMM', 'JPTND', 'PLPLC', 'RUNJK', 'DKFRC', 'KEMBA>>TZDAR', 'MRNKC', 'EGALY', 'ESPAS', 'CNGZU>HKHKG', 'ESGIJ', 'SARAB']

In [93]:
df_2 = pd.read_excel('./data/destination_review.xlsx')

In [125]:
col = ['port_code', 'port_name']

In [100]:
df_3 = df_2.iloc[1:-3, -2:]

In [126]:
df_3.columns=col

In [127]:
df_3.head()

  port_code           port_name
1     ADALV    Andorra la Vella
2     ADCAN             Canillo
3     ADENC              Encamp
4     ADESC  Escaldes-Engordany
5     ADFMO   La Farga de Moles

In [143]:
len(df_3)

88088

In [150]:
sum(df_3['port_code'].isnull())

66

In [146]:
df_3[df_3['port_code'].isnull()]

      port_code              port_name
1145        NaN  Neumarkt and der Ybbs
1809        NaN                Croydon
3197        NaN                Pangaon
4408        NaN            Plassendale
4699        NaN           Thorntonbank
...         ...                    ...
69997       NaN                  Yombo
69998       NaN               Zanzibar
79054       NaN            New Bedford
81605       NaN               Riceboro
88049       NaN                  Monze

[66 rows x 2 columns]

In [147]:
sum(df_3['port_name'].isnull())

0

In [151]:
df_3 = df_3.dropna()

In [163]:
sum(df_3['port_code'].duplicated())

593

In [168]:
df_3[df_3['port_code'].duplicated()][:10]

     port_code              port_name
409      ARLBA               La Banda
655      ATBKD               Birkfeld
1077     ATMML  Mitterdorf im Murztal
1078     ATMML  Mitterdorf im Murztal
1079     ATMML  Mitterdorf im Murztal
1765     AUBWD               Burswood
2006     AUECK          Eastern Creek
2635     AUPKH              Peakhurst
2976     AUWGO           Wattle Grove
7862     CACAA              Caledonia

In [172]:
df_3[df_3['port_code'] == 'ARLBA']

    port_code port_name
408     ARLBA   Loberia
409     ARLBA  La Banda

In [173]:
df_3[df_3['port_code'] == 'ATBKD']

    port_code port_name
654     ATBKD  Birkfeld
655     ATBKD  Birkfeld

In [174]:
sum(df_3['port_name'].duplicated())

9926

In [176]:
sum(df_3.duplicated())

42

In [169]:
df_3[df_3.duplicated()][:10]

     port_code              port_name
655      ATBKD               Birkfeld
1077     ATMML  Mitterdorf im Murztal
1078     ATMML  Mitterdorf im Murztal
1079     ATMML  Mitterdorf im Murztal
1765     AUBWD               Burswood
2006     AUECK          Eastern Creek
2976     AUWGO           Wattle Grove
8827     CALWF              Lowe Farm
9530     CASCG         Spences Bridge
9531     CASCG         Spences Bridge

In [175]:
df_3.describe()

       port_code port_name
count      88022     88022
unique     87429     78096
top        NOFAA   Newport
freq           4        28

In [152]:
df_3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 88022 entries, 1 to 88088
Data columns (total 2 columns):
port_code    88022 non-null object
port_name    88022 non-null object
dtypes: object(2)
memory usage: 2.0+ MB

----

In [227]:
df_1 = pd.read_csv('./data/port_code.csv')

In [228]:
df_1.head()

  port_code                          port_name country_code
0     CNSZX                           Shenzhen           CN
1     VNSGN  Ho Chi Min City (formerly Saigon)           VN
2     DKAAB                           Aabenraa           DK
3     SGSIN                          Singapore           SG
4     INNSA                        NHAVA SHEVA           IN

In [229]:
df_1 = df_1.iloc[:,:-1]

In [230]:
df_1.head()

  port_code                          port_name
0     CNSZX                           Shenzhen
1     VNSGN  Ho Chi Min City (formerly Saigon)
2     DKAAB                           Aabenraa
3     SGSIN                          Singapore
4     INNSA                        NHAVA SHEVA

In [231]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2493 entries, 0 to 2492
Data columns (total 2 columns):
port_code    2493 non-null object
port_name    2493 non-null object
dtypes: object(2)
memory usage: 39.1+ KB

In [232]:
df_1.describe()

       port_code port_name
count       2493      2493
unique      2493      2492
top        KRBUK    Ningbo
freq           1         2

In [233]:
df_1[df_1['port_code'].duplicated()]

Empty DataFrame
Columns: [port_code, port_name]
Index: []

In [234]:
df_1[df_1['port_code'] == 'INNSA']

  port_code    port_name
4     INNSA  NHAVA SHEVA

In [235]:
df_1[df_1['port_name'].duplicated()]

     port_code port_name
2479     CNNGB    Ningbo

In [236]:
df_1[df_1['port_name'] == 'Ningbo']

     port_code port_name
2478     CNNBO    Ningbo
2479     CNNGB    Ningbo

In [237]:
df_1['source'] = 0

In [238]:
df_1.head()

  port_code                          port_name  source
0     CNSZX                           Shenzhen       0
1     VNSGN  Ho Chi Min City (formerly Saigon)       0
2     DKAAB                           Aabenraa       0
3     SGSIN                          Singapore       0
4     INNSA                        NHAVA SHEVA       0

In [239]:
df_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2493 entries, 0 to 2492
Data columns (total 3 columns):
port_code    2493 non-null object
port_name    2493 non-null object
source       2493 non-null int64
dtypes: int64(1), object(2)
memory usage: 58.6+ KB

----

In [240]:
df_2 = pd.read_excel('./data/world_ports.xls')

In [241]:
df_2.head()

   S/N Country Code   Country Description Port Code Port Description
0    1           AD               ANDORRA     ADZZZ      O P ANDORRA
1    2           AE  UNITED ARAB EMIRATES     AEAJM            AJMAN
2    3           AE  UNITED ARAB EMIRATES     AEAUH        ABU DHABI
3    4           AE  UNITED ARAB EMIRATES     AEDAS       DAS ISLAND
4    5           AE  UNITED ARAB EMIRATES     AEDXB            DUBAI

In [242]:
col = ['port_code', 'port_name']

In [243]:
df_2 = df_2.iloc[:, 3:]

In [245]:
df_2.columns = col

In [246]:
df_2.head()

  port_code    port_name
0     ADZZZ  O P ANDORRA
1     AEAJM        AJMAN
2     AEAUH    ABU DHABI
3     AEDAS   DAS ISLAND
4     AEDXB        DUBAI

In [247]:
df_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7547 entries, 0 to 7546
Data columns (total 2 columns):
port_code    7547 non-null object
port_name    7547 non-null object
dtypes: object(2)
memory usage: 118.0+ KB

In [248]:
df_2.describe()

       port_code port_name
count       7547      7547
unique      7547      7466
top        FIVLA     OTHER
freq           1         6

In [250]:
sum(df_2['port_name'].duplicated())

81

In [249]:
df_2[df_2['port_name'].duplicated()]

     port_code      port_name
568      BOSRZ     SANTA CRUZ
815      BZSPR      SAN PEDRO
954      CASYD         SYDNEY
1117     CISPY      SAN PEDRO
1195     CMVCC       VICTORIA
...        ...            ...
7346     VEMTV       MATANZAS
7359     VESFD   SAN FERNANDO
7365     VESTD  SANTO DOMINGO
7366     VESVZ    SAN ANTONIO
7493     ZAMES        MESSINA

[81 rows x 2 columns]

In [252]:
df_2[df_2['port_name'] == 'SAN PEDRO']

     port_code  port_name
155      ARSPD  SAN PEDRO
815      BZSPR  SAN PEDRO
1117     CISPY  SAN PEDRO

In [253]:
df_2['source'] = 1

In [254]:
df_2.head()

  port_code    port_name  source
0     ADZZZ  O P ANDORRA       1
1     AEAJM        AJMAN       1
2     AEAUH    ABU DHABI       1
3     AEDAS   DAS ISLAND       1
4     AEDXB        DUBAI       1

In [255]:
len(df_2)

7547

----

In [303]:
df_total = pd.concat([df_1, df_2], axis=0)

In [304]:
df_total.sample(10)

     port_code        port_name  source
4339     MKJNC          JACINCE       1
4319     MGWML      MALAIMBANDY       1
5054     NZNPE           NAPIER       1
6669     TRTUR     TURAN, IZMIR       1
7486     ZAHLA      KRUGERSDORT       1
1084     CGION         IMPFONDO       1
444      AUWOT    WONTHAGGI, VI       1
2684     GBRYE   RYE/FOLKESTONE       1
2454     GALBV       LIBREVILLE       1
4497     MXSMI  ISLA SAN MARCOS       1

In [305]:
df_total.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 10040 entries, 0 to 7546
Data columns (total 3 columns):
port_code    10040 non-null object
port_name    10040 non-null object
source       10040 non-null int64
dtypes: int64(1), object(2)
memory usage: 313.8+ KB

In [306]:
sum(df_total['port_code'].duplicated())

1746

In [307]:
df_total[df_total['port_code'].duplicated()]

     port_code       port_name  source
1        AEAJM           AJMAN       1
3        AEDAS      DAS ISLAND       1
4        AEDXB           DUBAI       1
6        AEFJR        FUJAIRAH       1
7        AEJEA       JEBEL ALI       1
...        ...             ...     ...
7483     ZAELS     EAST LONDON       1
7497     ZAMZY      MOSSEL BAY       1
7503     ZAPLZ  PORT ELIZABETH       1
7507     ZARCB    RICHARDS BAY       1
7509     ZASDB    SALDANHA BAY       1

[1746 rows x 3 columns]

In [308]:
sum(df_total[['port_name','port_code']].duplicated())

3

In [309]:
df_total[df_total[['port_name','port_code']].duplicated()]

     port_code    port_name  source
2546     GBFLE    FLEETWOOD       1
3344     INJGA     JAMNAGAR       1
3377     INNSA  NHAVA SHEVA       1

In [310]:
df_total[df_total['port_code'] == 'GBFLE']

     port_code  port_name  source
1920     GBFLE  FLEETWOOD       0
2546     GBFLE  FLEETWOOD       1

In [311]:
df_total[df_total['port_code'] == 'INJGA']

     port_code port_name  source
1985     INJGA  JAMNAGAR       0
3344     INJGA  JAMNAGAR       1

In [312]:
df_total[df_total['port_code'] == 'INNSA']

     port_code    port_name  source
4        INNSA  NHAVA SHEVA       0
3377     INNSA  NHAVA SHEVA       1

In [313]:
df_total = df_total.drop([2546, 3344, 3377])

In [314]:
df_total[df_total[['port_name','port_code']].duplicated()]

Empty DataFrame
Columns: [port_code, port_name, source]
Index: []

In [315]:
len(df_total)

10037

In [276]:
df_total[df_total['port_code'] == 'AEAJM']

     port_code port_name  source
2276     AEAJM     Ajman       0
1        AEAJM     AJMAN       1

In [280]:
df_total[df_total['port_code'] == 'CLBAG']

     port_code       port_name  source
1804     CLBAG        Gregorio       0
1128     CLBAG  BAHIA GREGORIO       1

In [316]:
df_total[df_total['port_code'].duplicated()].sample(20)

     port_code               port_name  source
2070     ESLCG               LA CORUNA       1
3705     JPHKT         HAKATA, FUKUOKA       1
7288     UYFZB             FRAY BENTOS       1
41       ALSAR                 SARANDE       1
3789     JPKUH       KUSHIRO, HOKKAIDO       1
7290     UYMVD              MONTEVIDEO       1
2479     GBARD               ARDROSSAN       1
5337     PGPOM            PORT MORESBY       1
3931     JPSMN    SAKAIMINATO, TOTTORI       1
5583     PHMNS  MANILA (SOUTH HARBOUR)       1
7341     VELSV   LA SALINA/MARACAIBO L       1
6289     SESOE              SODERTALJE       1
4468     MXGYM            GUAYMAS, SON       1
6850     USCHS          CHARLESTON, SC       1
7253     USTXT          TEXAS CITY, TX       1
5177     PESNX             SAN NICOLAS       1
1443     CNXMN           XIAMEN (XIAN)       1
5769     PRGUX         GUANICA HARBOUR       1
2093     ESPMI       PALMA DE MALLORCA       1
4903     NOHOL             HOLMESTRAND       1

In [317]:
df_total = df_total.drop_duplicates(subset=['port_code'], keep='first')

In [318]:
df_total[df_total['port_code'].duplicated()]

Empty DataFrame
Columns: [port_code, port_name, source]
Index: []

In [319]:
df_total.head()

  port_code                          port_name  source
0     CNSZX                           Shenzhen       0
1     VNSGN  Ho Chi Min City (formerly Saigon)       0
2     DKAAB                           Aabenraa       0
3     SGSIN                          Singapore       0
4     INNSA                        NHAVA SHEVA       0

In [320]:
len(df_total)

8294

In [321]:
df_total.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8294 entries, 0 to 7546
Data columns (total 3 columns):
port_code    8294 non-null object
port_name    8294 non-null object
source       8294 non-null int64
dtypes: int64(1), object(2)
memory usage: 259.2+ KB

In [323]:
df_total.to_csv('./data/port_code_total.csv', encoding='utf_8', header=1, index=0)

In [153]:
df_total=df_total.drop(index=df_total.index)

In [350]:
print(conn)

<connection object at 0x00000214433D5488; dsn: 'user=dbuser password=xxx dbname=map host=192.168.102.89 port=5432', closed: 0>

In [475]:
sql = "SELECT P.port_code, P.port_name FROM ports.port_code AS P;"

In [476]:
cursor = conn.cursor()
cursor.execute(sql)

In [477]:
port_code = cursor.fetchall()

In [354]:
print(type(port_code))

<class 'list'>

In [355]:
for i in port_code[:5]:
    print(i)

('CNSZX', 'Shenzhen')
('VNSGN', 'Ho Chi Min City (formerly Saigon)')
('DKAAB', 'Aabenraa')
('SGSIN', 'Singapore')
('INNSA', 'NHAVA SHEVA')

In [357]:
port_name_list[:5]

['Shenzhen',
 'Ho Chi Min City (formerly Saigon)',
 'Aabenraa',
 'Singapore',
 'NHAVA SHEVA']

In [362]:
s = "B.ABBA'S"

In [364]:
s.replace("'", "''")

"B.ABBA''S"

100 test1
100 test2

In [468]:
test_1 = fuzz.ratio('MANZANILLO', 'Manzanillo, Cuba')
print(test_1, 'test1')

test_2 = fuzz.ratio('MANZANILLO', 'MANZANILLO')
print(test_2, 'test2')

8 test1
100 test2

In [470]:
test_1 = fuzz.partial_ratio('MANZANILLO', 'Manzanillo, Cuba')
print(test_1, 'test1')

test_2 = fuzz.partial_ratio('MANZANILLO', 'MANZANILLO')
print(test_2, 'test2')

10 test1
100 test2

In [471]:
test_1 = fuzz.token_sort_ratio('MANZANILLO', 'Manzanillo, Cuba')
print(test_1, 'test1')

test_2 = fuzz.token_sort_ratio('MANZANILLO', 'MANZANILLO')
print(test_2, 'test2')

80 test1
100 test2

In [472]:
test_1 = fuzz.token_set_ratio('MANZANILLO', 'Manzanillo, Cuba')
print(test_1, 'test1')

test_2 = fuzz.token_set_ratio('MANZANILLO', 'MANZANILLO')
print(test_2, 'test2')

100 test1
100 test2

In [484]:
test_1 = fuzz.token_set_ratio('FOR ORDERS', 'Ambarli')
print(test_1, 'test1')

test_2 = fuzz.token_set_ratio('FOR ORDERS', 'Kuala Tanjung')
print(test_2, 'test2')

12 test1
9 test2

In [2]:
import psycopg2

In [3]:
host = '192.168.102.89'
port = 5432
user = 'dbuser'
password = 'dbuser123'
database = 'map'

In [4]:
conn = psycopg2.connect(host=host, port=port, user=user, password=password, database=database)

In [6]:
sql = "SELECT P.unctad, P.name FROM ports.port_new AS P;"

cursor = conn.cursor()
# Execute eql statements
cursor.execute(sql)

# Get result
port_code = cursor.fetchall()

# Init container
port_code_dict = {}
port_name_list = []
for (code, name) in port_code:
    port_code_dict[code] = name
    port_name_list.append(name)

In [18]:
cursor.close()
conn.close()

In [15]:
process.extract('PANAMA', port_name_list, limit=5)

[('Panama', 100),
 ('PANAMA CANAL', 90),
 ('PanamA, Ciudad de', 90),
 ('Panama City, Florida, U.S.A.', 90),
 ('Anambra', 77)]

In [16]:
process.extract('CRISTOBAL-PANAMA', port_name_list, limit=5)

[('ist', 90), ('TOBA', 90), ('Sto', 90), ('Cristobal', 90), ('Panama', 90)]

In [17]:
process.extract('CRISTOBAL-PANAMA', ['istanbul', 'TOBATA', 'Norway Sto', 'Cristobal'], limit=5)

[('Cristobal', 90), ('TOBATA', 60), ('istanbul', 56), ('Norway Sto', 31)]

In [515]:
for i in port_name_list:
    if i == 'ist':
        print(i)

In [7]:
len(port_name_list)

15399

In [12]:
ratio_list = []
for name in port_name_list:
    ratio = fuzz.token_set_ratio('CRISTOBAL-PANAMA', name)
    ratio_list.append((name + ' + name', ratio))
for code in port_code_dict.keys():
    ratio = fuzz.token_set_ratio('CRISTOBAL-PANAMA', code)
    ratio_list.append((port_code_dict[code] + ' + code: ' + code, ratio))

ratio_rank = sorted(ratio_list, key=lambda x: x[1], reverse=True)[:5]
print(ratio_rank)

[('Cristobal + name', 100), ('Panama + name', 100), ('San Cristobal de Entrevinas + name', 72), ('PANAMA CANAL + name', 71), ('SANTA RiTA + name', 62)]

In [13]:
ratio_list = []
for name in port_name_list:
    ratio = fuzz.token_set_ratio('PANAMA', name)
    ratio_list.append((name + ' + name', ratio))
for code in port_code_dict.keys():
    ratio = fuzz.token_set_ratio('PANAMA', code)
    ratio_list.append((port_code_dict[code] + ' + code: ' + code, ratio))

ratio_rank = sorted(ratio_list, key=lambda x: x[1], reverse=True)[:5]
print(ratio_rank)

[('PANAMA CANAL + name', 100), ('PanamA, Ciudad de + name', 100), ('Panama City, Florida, U.S.A. + name', 100), ('Panama + name', 100), ('Anambra + name', 77)]

In [481]:
from fuzzywuzzy import process

In [509]:
process.extract('PANAMA CANAL', port_name_list, limit=5)

[('Ama', 90),
 ('AMA', 90),
 ('CANA', 90),
 ('Panama City, Florida, U.S.A.', 86),
 ('MANAMA', 75)]

In [510]:
process.extract('PANAMA', ['PAPAN', 'Panama', 'Ön'], limit=5)

[('Panama', 100), ('Ön', 90), ('PAPAN', 55)]

In [501]:
process.extract('PANAMA', ['PAPAN', 'Panama'], limit=5)

[('Panama', 100), ('PAPAN', 55)]

In [502]:
process.extract('PANAMA CANAL', ['PAPAN', 'Panama'], limit=5)

[('Panama', 90), ('PAPAN', 54)]

In [489]:
process.extract('MANZANILLO', port_name_list, limit=1)

[('MANZANILLO', 100)]

In [491]:
process.extract('Shang Hai', port_name_list, limit=1)[0]

('Shanghai', 94)

In [488]:
process.extract('ShangHai', port_name_list, limit=1)

[('Shanghai', 100)]

In [508]:
process.extract('PANAMA', port_code_dict.keys(), limit=5)

[('KPNAM', 73), ('JPAMA', 73), ('PAAML', 73), ('PAPAM', 73), ('ANAUA', 73)]

In [ ]:
Ama   PANAMA CANAL

In [ ]:
MANZANILLO,PANAMA

In [493]:
process.extract('MANZANILLO,PANAMA', port_name_list, limit=5)

[('Ama', 90), ('MAN', 90), ('MANZANILLO', 90), ('MANZANILLO', 90), ('AMA', 90)]

In [497]:
process.extract('SHANG HAI', port_name_list, limit=5)

[('Shanghai', 94),
 ('SHANGHAI', 94),
 ('SHANGHAI PU DONG APT', 80),
 ('Maji Shan', 74),
 ('CHIANG-RAI', 74)]

In [ ]:
SHANG HAI GANG

In [ ]:
NLTNZ   NLRTM

In [511]:
process.extract('CRISTOBAL-PANAMA', port_name_list, limit=5)

[('Cristobal', 90),
 ('Ama', 90),
 ('AMA', 90),
 ('Panama City, Florida, U.S.A.', 86),
 ('O P PANAMA', 86)]

In [499]:
process.extract('NLRTM', port_code_dict.keys(), limit=5)

[('NLRTM', 100), ('NLWRT', 80), ('NLPER', 60), ('NLBOT', 60), ('BRSTM', 60)]

In [ ]:
CRISTOBAL-PANAMA

In [406]:
ls = [i for i in range(150013)]

In [407]:
len(ls)

150013

In [408]:
step = 2000

In [390]:
import math

In [391]:
math.ceil(len(l) / step)

76

In [409]:
def chunks(ls, step):
    for i in range(0, len(ls), step):
        yield ls[i: i + step]

In [410]:
ls_groups = chunks(ls, step)

In [453]:
des = '>THAILAND'

In [454]:
if '>' in str(des):
    index = des.index('>') + 1

    des_start = des[:index - 1].strip()
    des_end = des[index:].strip().strip('>')

    if 'OFF' in str(des_end):
        index_off = des_end.index('OFF')
        des_end = des_end[: index_off].strip()

In [455]:
print(des_start)

In [457]:
print(len(des_start))

0

In [456]:
print(des_end)

THAILAND